// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// function minNum(num1, num2, num3) {
//     if (num1 < num2 && num1 < num3) {
//         console.log(num1);
//     } else if (num2 < num1 && num2 < num3) {
//         console.log(num2)
//     } else {
//         console.log(num3)
//     }
// }
//
// minNum(10, 3, 1)

// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)

// function maxNum(num1, num2, num3) {
//     if (num1 > num2 && num1 > num3) {
//         console.log(num1)
//     } else if (num2 > num1 && num2 > num3) {
//         console.log(num2)
//     } else {
//         console.log(num3)
//     }
// }
//     maxNum(4,45,200);
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################


// - створити функцію яка повертає найбільше число з масиву
//
// function maxNumInArr(arr){
//     let max = arr[0]
//     for (let arrElement of arr) {
//         if (arrElement>max){
//             max = arrElement
//         }
//     }
//     return max
//
// }
//
// let arrMimix = [11,12355,145,456,7556];
//
// console.log(maxNumInArr(arrMimix));
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------###
// ###################################
// - створити функцію яка повертає найменьше число з масиву

// function returnMinNum (arr){
//     let min = arr[0];
//     for (let arrElement of arr) {
//         if (arrElement<min){
//             min = arrElement;
//         }
//     }
//     return min
// }
//
// let arrMimix = [11,12355,1.5, 145, 4, 0.5,7556];
// console.log( returnMinNum(arrMimix))
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13

// function sumatorArr (arr){
//     let result = 0;
//     for (let arrElement of arr) {
//         result = result + arrElement;
//     }
//     return result
// }
//
// let arrMimix = [ 1, 5, 4];
// console.log(sumatorArr(arrMimix));

// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// function centralNumInArr(arr){
//     let sumator=0;
//     for (let arrElement of arr) {
//         sumator = sumator + arrElement
//     }
//     return sumator/arr.length
// }
// let arrMimix = [ 2, 5, 5];
// console.log(centralNumInArr(arrMimix))
//
// // ######################################---------#######
//
// function modernCenterNumInArr (arr){
//     return sumatorArr(arr)/arr.length
// }
// console.log(modernCenterNumInArr(arrMimix));
//

// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// debugger;

// function returnMinLogMax(){
//     let min = arguments[0];
//     let max = arguments[0];
//     for (let i = 0; i < arguments.length; i++) {
//         let argument = arguments[i];
//         if (argument > max){
//             max = argument;
//         } else if (argument < min){
//             min = argument;
//         }
//     }
//     console.log(max);
//     return min;
// }
//
// console.log(returnMinLogMax(2, 5, 15, 1.20, 50, 150));
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.

// let startArr =[];
// function addInArrNum (arr){
//     for (let i = 0; i < 100; i++) {
//         arr.push(Math.round(Math.random()*100))
//     }
// }
//
// console.log(startArr);
// addInArrNum(startArr);
// console.log(startArr);

// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################

// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.

// let startArr = []
// function limitedAddNumInArr(arr,size=1){
//     for (let i = 0; i < size; i++) {
//         startArr.push(Math.round(Math.random()*100))
//     }
// }
//
// console.log(startArr);
// limitedAddNumInArr(startArr,24);
// console.log(startArr);

// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################
// ######################################---------######################################---------######################################

// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].

// function newReversArr (arr){
//     let newArr=[];
//     for (let i = arr.length-1; i >= 0 ; i--) {
//         newArr.push(arr[i])
//     }
//     return newArr;
// }
//
// let arrMimix = [ 2, 5, 7];
//
// console.log(arrMimix);
// console.log(newReversArr(arrMimix));


