// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let userNum1 = +prompt('Enter the first number (1,2,3 ...) ')
// let userNum2 = +prompt('Enter the second number (1,2,3 ...) ')
//
// if (userNum1 > userNum2) {
//     console.log(`Your first number is ${userNum1} more than your second number is ${userNum2}`)
// } else if (userNum1 < userNum2) {
//     console.log(`Your second number is ${userNum2} more than the first number is ${userNum1}`)
// } else if (userNum1 === userNum2){
//     console.log(`Your numbers ${userNum1} and ${userNum2} are the same`)
// } else {
//     console.log('WTF ??? I asked to enter numbers !')
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let number = +prompt('Enter the accommodation number')
// number>0 && number <= 20 ? console.log('This apartment is located in the house #1') :
//     number>20 && number <= 48 ? console.log('This apartment is located in the house #2') :
//         number > 48 && number <= 90 ? console.log('This apartment is located in the house #2') :
//             console.log('I do not know where this apartment is');

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let number = +prompt('Guess the number I came up with')
// number === 10? console.log('Yes, I thought 10 !! :)') : console.log('No, I thought 10 !! :(')

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#


// let x ;
//
// x = 1;
// x = 'ok';
// x = true;
// x = [1,2,3];
//
// if (typeof x === "number"){
//     console.log(1);
// } else if (typeof x === "string"){
//     console.log(2)
// }else if (typeof x === "boolean"){
//     console.log(3);
// }else if (typeof x === "object"){
//     console.log(4)
// }else {
//     console.log(typeof `${x}`)
// }


// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let temp =Math.round(Math.random()*(30-1)+1)
// temp > 10 && temp <= 22 ? console.log(`температура: ${temp} - йдемо ВЧИТИСЯ`) : console.log(`температура: ${temp} - вчимося ОНЛАЙН`);

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let someNum = Math.round(Math.random()*(5-1)+1)
// --#--#--#--#--#--#--#--#
// let someNum = +prompt('Enter any number from 1 to 5');
//
// switch (someNum){
//     case 1:
//         console.log('You won the car!')
//         break
//     case 2:
//         console.log('You won the phone!')
//         break
//     case 3:
//         console.log('Try again !')
//         break
//     case 4:
//         console.log('You won the mug!')
//         break
//     case 5:
//         console.log('Good luck next time!')
//         break
//     default:
//         console.log(`${someNum} - the number is incorrect ...`)
// }