// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arrNum = [];
// arrNum[0] = Math.round(Math.random()*(50-1)+1);
// arrNum[1] = Math.round(Math.random()*(50-1)+1);
// arrNum[2] = Math.round(Math.random()*(50-1)+1);
// arrNum[3] = Math.round(Math.random()*(50-1)+1);
// arrNum[4] = Math.round(Math.random()*(50-1)+1);
// arrNum[5] = Math.round(Math.random()*(50-1)+1);
// console.log(arrNum)
//
// let arrSrt = ['azazaz', 'lololo', 'Alex', 'Kas', 'Okten'];
// console.log(arrSrt)
//
// let arrMix = ['azazaz', 45, true, 47, 'lolol'];
// console.log(arrMix)

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arr = [];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = true;
// arr[4] = false;
// arr[5] = 'Hello world';
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = false;
// arr[10] = 10;
// console.log(arr)

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// for (let i = 1; i <= 10; i++) {
//     document.write(`<div> some text   </div> `)
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// for (let i = 1; i <= 10; i++) {
//     document.write(`<div> some text | index = ${i} </div> `)
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let i=1
// while (i<=20){
//     document.write(`<h1> any text`)
//     i++
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let i=1
// while (i<=20){
//     let num = Math.round(Math.random()*(50-1)+1)
//     document.write(`<h1> any num: ${num} | index = ${i}`)
//     i++
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arr=[];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = Math.round(Math.random()*(50-1)+1);
// arr[2] = Math.round(Math.random()*(50-1)+1);
// arr[3] = Math.round(Math.random()*(50-1)+1);
// arr[4] = Math.round(Math.random()*(50-1)+1);
// arr[5] = Math.round(Math.random()*(50-1)+1);
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = Math.round(Math.random()*(50-1)+1);
// arr[8] = Math.round(Math.random()*(50-1)+1);
// arr[9] = Math.round(Math.random()*(50-1)+1);
// arr[10] = Math.round(Math.random()*(50-1)+1);
// console.log(arr)
//
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     console.log(arrElement);
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arr = [];
// arr[0] = 'lololo';
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = 'azazazaza';
// arr[4] = 'false';
// arr[5] = 'Hello world';
// arr[6] = 'mon';
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = 'fo';
// arr[10] = '10';
// console.log(arr);
//
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     console.log(arrElement);
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arr = [];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = true;
// arr[4] = false;
// arr[5] = 'Hello world';
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = false;
// arr[10] = 10;
// console.log(arr)
//
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     console.log(arrElement);
//
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arr = [];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = true;
// arr[4] = false;
// arr[5] = 'Hello world';
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = false;
// arr[10] = 10;
// console.log(arr)
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     if (typeof arrElement === "boolean"){
//         console.log(arrElement);
//     }
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#


// let arr = [];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = true;
// arr[4] = false;
// arr[5] = 'Hello world';
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = false;
// arr[10] = 10;
// console.log(arr)
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     if (typeof arrElement === "number"){
//         console.log(`${i} - ${arrElement}`)
//     }
//
// }


// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#


// let arr = [];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = true;
// arr[4] = false;
// arr[5] = 'Hello world';
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = false;
// arr[10] = 10;
// console.log(arr)
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     if (typeof arrElement === "string"){
//         console.log(`${i} - ${arrElement}`)
//     }
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// let arr = [];
// console.log(arr)
// arr[0]=Math.round(Math.random()*(100-11)+11);
// arr[1]='20';
// arr[2]=Math.round(Math.random()*(2000-11)+11);
// arr[3]= {
//     name: 'Alex',
//     age: 25
// };
// arr[4]=Math.round(Math.random()*(50000000000-5)+5);
//
// arr[5]=false;
// arr[6]= {
//     model: 'Ramo',
//     year:1990
// };
// arr[7]=Math.round(Math.random()*(10-1)+1);
// arr[8]='Oktennnn';
// arr[9]=true;
// arr[10]=Math.round(Math.random()*(500-50)+50);
// console.log(arr)
//
//
// for (let i = 0; i < arr.length; i++) {
//     const arrElement = arr[i];
//     console.log(`${i} - ${arrElement}`)
//
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#


// let arr = [];
// arr[0] = Math.round(Math.random()*(50-1)+1);
// arr[1] = 'lorem ...';
// arr[2] = 'OOOOOOOOkten';
// arr[3] = true;
// arr[4] = false;
// arr[5] = 'Hello world';
// arr[6] = Math.round(Math.random()*(50-1)+1);
// arr[7] = 'Alex';
// arr[8] = 'Kas';
// arr[9] = false;
// arr[10] = 10;
// console.log(arr)
// for (let i = 0; i <= 10; i++) {
//     console.log(i);
//     document.write(`${i} <br>`)
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// for (let i = 0; i <= 100; i++) {
//     console.log(i);
//     document.write(`${i} <br>`);
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// for (let i = 0; i <= 100; i += 2) {
//             console.log(i);
//         document.write(`${i} <br> <hr>` );
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// for (let i = 1; i <= 100; i++) {
//     if (!(i % 2)){
//         console.log(i);
//         document.write(`${i} <br> <hr>` );
//     }
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

// for (let i = 0; i <= 100; i++) {
//     if (i%2){
//         console.log(i);
//         document.write(`${i} <br> <hr>` );
//     }
// }

// --#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#--#

