
// ################  HOMEWORK  ##################


// - Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//     Вивести кожну змінну за допомогою: console.log , alert, document.write
// - Переприсвоїти кожній змінній з завдання значення на довільне.
//     Вивести кожну змінну за допомогою: console.log , alert, document.write
// -----------------------------------------------------------------------
// - Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. З'єднати їх в одну змінну person. (Не об'єкт)
// -----------------------------------------------------------------------
// let firstName = 'Kasianov';
// let middleName = 'Oleksandr';
// let lastName = 'Serhiyovych';
// let person = firstName + ' ' + middleName + ' ' + lastName;
// console.log(person)
// -----------------------------------------------------------------------
// - За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
//     Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".
// -----------------------------------------------------------------------
// let middleName = prompt('How you name ?');
// let lastName = prompt ('How you last name ?');
// let old = prompt('How old are you ?');
// document.write( `Hello ${middleName} ${lastName}. You have ${old} years !`)
// -----------------------------------------------------------------------
// - За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
// -----------------------------------------------------------------------
//     let a = 100;
// console.log(typeof a);
//
//     let b = '100';
// console.log(typeof  b);
//
//     let c = true;
// console.log(typeof c);

// #############################################################
// #############################################################
// - Визначити відповідний оператор в виразах що б вийшов відповідний результат.
//     В однакових виразах не використовувати однакові оператори!!!

//     5 ? 6 -> true
// console.log(5<6);
// ----------------------c-------------------------------------------------
// 5 ? 6 -> false
// console.log(5>6);
// -----------------------------------------------------------------------
// 5 ? 6 -> false
// console.log(5 == 6);
// -----------------------------------------------------------------------
// 5 ? 6 -> false
// console.log(5>=6);
// -----------------------------------------------------------------------
// 10 ? 10 -> true
// console.log(10===10);
// -----------------------------------------------------------------------
// 10 ? 10 -> true
// console.log(10 == 10);
// -----------------------------------------------------------------------
// 10 ? 10 -> false
// console.log(10<10);
// -----------------------------------------------------------------------
// 10 ? 10 -> false
// console.log(10>10);
// -----------------------------------------------------------------------
// 10 ? 10 -> false
// console.log(10 !== 10)
// -----------------------------------------------------------------------
// 123 ? '123' -> false
// console.log(123 === '123');
// -----------------------------------------------------------------------
// 123 ? '123' -> true
// console.log(123 == '123')


// #############################################################
// #############################################################
// - Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
// let str = "20";
// let a = 5;

// document.write(str + a + "<br/>");
//  -->  205 (стрічка) і  новий рядок.
// ==================================================
// document.write(str - a + "<br/>");
//  -->  15 (стрічка) і  новий рядок
// ==================================================
// document.write(str * "2" + "<br/>");
//  -->  40 (стрічка) і  новий рядоки
// ==================================================
// document.write(str / 2 + "<br/>");
//  -->  10 (стрічка)  і  новий рядок