// - Знайти та вивести довижину настипних стрінгових значень
// 'hello world', 'lorem ipsum', 'javascript is cool'

// let str = 'hello world';
// console.log(str.length);
//
// let loremIpsum = 'lorem ipsum';
// console.log(loremIpsum.length);
//
// let javascriptIsCool = 'javascript is cool';
// console.log(javascriptIsCool.length);

// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Перевести до великого регістру наступні стрінгові значення
// 'hello world', 'lorem ipsum', 'javascript is cool'

// let helloWorld = 'hello world';
// console.log(helloWorld.toLocaleUpperCase());
//
// let loremIpsum = 'lorem ipsum';
// console.log(loremIpsum.toLocaleUpperCase());
//
// let javascriptIsCool = 'javascript is cool';
// console.log(javascriptIsCool.toLocaleUpperCase());

// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----

// - Перевести до нижнього регістру настипні стрінгові значення
// 'HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'

// let helloworld = 'HELLO WORLD';
// console.log(helloworld.toLocaleLowerCase());
//
// let loremipsum = 'LOREM IPSUM';
// console.log(loremipsum.toLocaleLowerCase());
//
// let javascriptiscool = 'JAVASCRIPT IS COOL';
// console.log(javascriptiscool.toLocaleLowerCase());

// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.

// let str = ' dirty string   ';
// console.log(str);
// console.log(str.trim());

// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.
// let str = 'Каждый охотник желает знать';
// let arr = stringToarray(str);
// document.writeln(arr); // ['Каждый', 'охотник', 'желает', 'знать']

// let stringToarray= str=>  str.split(' ');
// let str = 'Каждый охотник желает знать';
// let azaza = 'яка перетворює рядок на масив слів.'
// console.log(stringToarray(str));
// console.log(stringToarray(azaza));

//
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Напишіть функцію delete_characters(str, length), яка повертає підрядок, що складається із зазначеної кількості символів.
//     let str = 'Каждый охотник желает знать';
// document.writeln(delete_characters(str, 7)); // Каждый

// let logDelete_characters = (str, length = 1) => {
//     console.log(str.slice(0, length));
// }
//
//     let str = 'Каждый охотник желает знать';
// logDelete_characters(str, 7);

// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Напишіть функцію insert_dash(str), яка приймає рядок str як аргумент і вставляє тире (-) між словами.
// При цьому всі символи рядка необхідно перевести у верхній регістр.
//     let str = "HTML JavaScript PHP";
// document.writeln(insert_dash(str)); // 'HTML-JAVASCRIPT-PHP'

// let logInsert_dash = str => console.log(str.split(' ').join('-').toLocaleUpperCase());
//     let str = "HTML JavaScript PHP";
//     let azaza = 'яка перетворює рядок на масив слів.'
//
// logInsert_dash(str)
// logInsert_dash(azaza)

// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Напишіть функцію, яка приймає рядок як аргумент і перетворює регістр першого символу рядка з нижнього регістру у верхній.

// let logUpperStart = (str) =>{
//     console.log(str.replace(str[0], str[0].toLocaleUpperCase()));
// }
// logUpperStart('hello');
// logUpperStart('alex');


// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// @@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----@@@@@@@----
// - Напишіть функцію capitalize(str), яка повертає рядок, у якому кожне слово починається з великої літери.


// function capitalize(str) {
//    let strArr = str.toLocaleLowerCase().split(' ');
//     for (let i = 0; i < strArr.length; i++) {
//         strArr[i] = strArr[i].charAt(0).toLocaleUpperCase() + strArr[i].substr(1);
//     }
//     return strArr.join(' ')
// }
//
// console.log(capitalize('skdjnvkds csjdnckjsdkn cbskjoicsdo ciosd'));