// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// #####################################################################################################################

// let time = Math.random()*60;
// if(time >= 0 && time <= 15 ){
//     console.log('Перша частина !');
// } else if (time >=15 && time <= 30 ){
//     console.log('Друга частина !');
// } else if (time >= 30 && time <= 45){
//     console.log('Третя частина !');
// } else if (time >= 45 && time <= 60){
//     console.log('Четверта частина !');
// }

//// #####################################################################################################################
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//// #####################################################################################################################

// let day = Math.round(Math.random()*(31 - 1)+1);
// if (day >=0 && day <=10){
//     console.log('Перша частина !');
// } else if (day >=10 && day <= 20){
//     console.log('Друга частина !');
// } else if (day >= 20 && day <= 30){
//     console.log('Третя частина !');
// }

//// #####################################################################################################################
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
////// #####################################################################################################################

// let test = confirm(' You are hungry ?')
// test ? console.log('yes') : console.log('no');
////// #########################
// if (test){
//     console.log('Yes')
// } else{
//     console.log('no')
// }

////// #####################################################################################################################
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
////// #####################################################################################################################

// let a = Math.round(Math.random()*(1-(-4))+(-4));
// a === 0 ? console.log('no') : console.log('yes');
// console.log(a)

////// #####################################################################################################################
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа
// що заплановано на цей день.
//////// #####################################################################################################################

// let weekday = +prompt('What is the day of the week now? (1,2,3...7)')
// switch (weekday){
//     case 1:
//         console.log('Готуйся до лекції від Октену !');
//         break;
//     case 2:
//         console.log('Сьогодні буде практичне заняття в Октені !');
//         break;
//     case 3:
//         console.log('  Сьогодні лекція в Октені. Ти зробив д/з ?')
//         let hw = prompt('Ти зробив д/з ?')
//         switch (hw){
//             case 'так':
//                 console.log('Можеш розслабити булки і відпочити');
//                 break;
//             case 'ні':
//                 console.log('Тоді доганяй хвости')
//                 break;
//         }
//         break;
//     case 4:
//         console.log('Ввечері йдем на практичне заняття')
//         break;
//     case 5:
//         console.log('Сьогодні буде лекція і консультація');
//         break;
//     case 6:
//         console.log(' Готовий до англійської ? Руслан тебе вже чекає');
//         break;
//     case 7:
//        let hw7 = prompt('Сьогодні недія. Ти виконав всі домашні роботи? (так / ні)')
//         switch (hw7){
//             case 'так':
//                 console.log('Можеш розслабити булки і відпочити')
//                 break;
//             case 'ні':
//                 console.log('Тоді доганяй хвости');
//                 break;
//             default:
//                 console.log('Я тебе не зрозумів');
//         }
//         break;
//     default:
//         console.log('Я тебе не зрозумів');
// }

////// #####################################################################################################################
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
////// #####################################################################################################################

// let year = Math.round(Math.random()*(2022-1990)+1990);
//         year % 4 ===0 ? console.log(` ${year} - This is a leap year`) : console.log(`${year} - This is not a leap year `);


//
// #####################################################################################################################
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// #####################################################################################################################

// let whatJs = prompt('What is the official name of JavaScript? ');
// if (whatJs === 'ECMAScript' || whatJs === 'ecmascript' || whatJs === 'ECMA Script' || whatJs === 'ecma script') {
//     console.log('Right!');
//     document.write('Right!');
// } else {
//     console.log("Dont know? ECMAScript!");
//     document.write('Dont know? ECMAScript!');
// }



// let test = +prompt();
// test>0 ? console.log('+') :
//     test<0 ? console.log('-') : console.log('0')