// - Дано натуральное число n. Выведите все числа от 1 до n.

// let limitArr = (n = 2) =>{
//     if (typeof n === "string" ||
//         typeof n === "boolean" ||
//         typeof n === "object"){
//         console.log('You have entered the wrong data type. You must enter a number !!!')
//     } else {
//         for (let i = 1; i <= n; i++) {
//             console.log(i)
//         }
//     }
// }
//
// limitArr(20)

// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания,
// если A < B, или в порядке убывания в противном случае.


//
// let manipulAandB = (a,b) =>{
//     if ( a > b){
//             for (let i = a; i >= b; i--) {
//                 console.log(i)
//             }
//         } else if (a < b){
//             for (let i = a; i <= b; i++) {
//                 console.log(i)
//
//             }
//         } else {
//         console.log('You have entered the wrong data type. You must enter a two number !!!')
//     }
// }
//
// manipulAandB(5, 5)
// manipulAandB(1, 6)

// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// #-############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// ***************************************************************

// let xxx = [9,8,0,4,7];
//
// let jumpNumInArr = (arr, index) => {
//     for (let i = 0; i < arr.length; i++) {
//         if (index === i){
//             arr[i] =arr[i] ^ arr[i + 1];
//             arr[i + 1] = arr[i] ^ arr[i + 1];
//             arr[i] = arr[i] ^ arr[i + 1];
//         }
//
//     }
//     return arr
// }
//
//
// console.log(xxx )
// console.log(jumpNumInArr(xxx, 0))

// ***************************************************************

// let xxx = [9,8,0,4,7];
//
// let jumpNumInArr = (arr, i) => {
// let xxx = arr[i];
// arr[i] = arr[i+1];
// arr[i+1] = xxx;
//
// return arr
// }
//
// console.log(xxx);
// console.log(jumpNumInArr(xxx, 0))

// ***************************************************************

// let xxx = [9, 8, 0, 4, 7];
//
// let jumpNumInArr = (arr, index) => {
//     for (let i = 0; i < arr.length; i++) {
//         if (index === i) {
//             [arr[i], arr[i + 1]] = [arr[i + 1], arr[i]]
//         }
//     }
//     return arr
// }
// console.log(xxx);
// console.log(jumpNumInArr(xxx,0));

// ***************************************************************

// let xxx = [9, 8, 0, 4, 7];
//
// let jumpNumInArr = (arr, index) => {
//     arr[index +1] = arr.splice(index,1, arr[index+1])[0];
//     return arr
// }
//
// console.log(xxx);
// console.log(jumpNumInArr(xxx,1))


// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Дoвжина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
//
//
// let zeroKiller = (arr) =>{
//     for (let i = 0; i < arr.length; i++) {
//         arr.push(arr.splice(arr.indexOf(0),1)[0])
//     }
//     return arr
// }
//
//
// let qqq = [1, 0, 6, 0, 3];
// let www = [0, 1, 0, 0,0, 0, 2, 3 ,0, 0, 4];
//
// console.log(qqq)
// console.log(zeroKiller(qqq));
//
// console.log(www)
// console.log(zeroKiller(www));
//

