// - Дано натуральное число n. Выведите все числа от 1 до n.

// let limitArr = (n = 2) =>{
//     if (typeof n === "string" ||
//         typeof n === "boolean" ||
//         typeof n === "object"){
//         console.log('You have entered the wrong data type. You must enter a number !!!')
//     } else {
//         for (let i = 1; i <= n; i++) {
//             console.log(i)
//         }
//     }
// }
//
// limitArr(20)

// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания,
// если A < B, или в порядке убывания в противном случае.


//
// let manipulAandB = (a,b) =>{
//     if ( a > b){
//             for (let i = a; i >= b; i--) {
//                 console.log(i)
//             }
//         } else if (a < b){
//             for (let i = a; i <= b; i++) {
//                 console.log(i)
//
//             }
//         } else {
//         console.log('You have entered the wrong data type. You must enter a two number !!!')
//     }
// }
//
// manipulAandB(5, 5)
// manipulAandB(1, 6)

// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]


// = = =  = = =  = = =  = = =  = = =  = = =  = = =  = = =  Варіант 1

// let jumpNumInArr = (arr, index) => {
//     for (let i = 0, k =0; i < arr.length, k < arr.length; i++, k+=2) {
//         if (index === i){
//             arr[i] = arr[k];
//             // Не знаю як замінити вибраний елемент масиву на сусідній
//         }
//     }
//     return arr
// }

// = = = = = =  = = =  = = =  = = =  = = =  = = =  = = =  Варіант 2

// let jumpNumInArr = (arr, index) => {
//     for (let i = 0; i < arr.length; i++) {
//         if (index === i){
//             arr[i] = arr[i+1];
//             // Не знаю як замінити вибраний елемент масиву на сусідній
//         }
//     }
//     return arr
// }
//
//
// let xxx = [9,8,0,4,7,89,44,78,36,4];
// // console.log(xxx);
// console.log(jumpNumInArr(xxx,0))






// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// #############****===****#############****===****#############****===****#############****===****#############****===****#############****===****
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Дoвжина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
